app/controllers/containers_controller.rb

  def index
    @containers = Container.all
---
SELECT "containers".* FROM "containers"

  def create
    @container = Container.new(container_params)

    respond_to do |format|
      if @container.save
---
INSERT INTO "containers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test container"], ["created_at", "2015-10-31 18:31:22.902140"], ["updated_at", "2015-10-31 18:31:22.902140"]]

  def update
    respond_to do |format|
      if @container.update(container_params)
---
UPDATE "containers" SET "name" = $1, "updated_at" = $2 WHERE "containers"."id" = $3  [["name", "new name"], ["updated_at", "2015-10-31 18:40:03.531171"], ["id", 61]]

  def destroy
    @container.destroy
---
DELETE FROM "containers" WHERE "containers"."id" = $1  [["id", 64]]

    def set_container
      @container = Container.find(params[:id])
---
SELECT  "containers".* FROM "containers" WHERE "containers"."id" = $1 LIMIT 1  [["id", 64]]