app/controllers/dashboard_controller.rb

  def index
    @container = current_user.containers.first
---
SELECT  "containers".* FROM "containers" WHERE "containers"."user_id" = $1  ORDER BY "containers"."id" ASC LIMIT 1  [["user_id", 2]]